{
  "components": {
    "languageSelect": {
      "languages": {
        "en": "English",
        "pl": "Polish"
      }
    },
    "preventInternetExplorer": {
      "title": "Oops!",
      "subtitle": "Internet explorer detected!",
      "description": "Internet Explorer web browser in any version is not supported. Not because I am lazy devloper (because I am not) - it is not supported due to security reasons. Internet Explorer is outdated, old, based on old/unsecure technologies and it is not recommended to use it at all.",
      "button": "Go unsecure",
      "legend": [
        "* You see this warning because whole website or component should not be used on Internet Explorer.",
        "** Going unsecure may be dangerous, also component or website can behave improperly."
      ]
    },
    "projectsList": {
      "projectTile": {
        "warningTitle": "Attention"
      }
    }
  },
  "layout": {
    "navigation": {
      "items": {
        "commercial": "Commercial",
        "projects": "Projects",
        "bio": "About me",
        "skills": "My skills & technologies",
        "workflow": "How do I work?",
        "passions": "My passions"
      }
    },
    "information": {
      "title": "Site under construction"
    },
    "footer": {
      "copyright": "© All copyrights reserved {date}"
    }
  },
  "pages": {
    "home": {
      "greeting": {
        "subtitle": "Full-stack developer",
        "subsubtitle": "Front-end enthusiast, back-end fan"
      },
      "commercial": {
        "title": "What have I experienced?",
        "subtitle": "Commercial projects",
        "projects": {
          "learningManagementSystem": {
            "title": "Learning Management System",
            "description": "Learning management system built as React app with store convention based on the redux & rematch. It is an administration panel that makes managing content, users, setting much easier. It additionally provides analytics with a couple of charts that represent the most important data."
          },
          "quizzesManagementSystem": {
            "title": "Quizzes Management System",
            "description": "Quizzes management system built for quizzes mobile application. It gives user which is chosen to manage quizzes possibility to create, assign to the group, delete. Quizzes are created by 'quiz wizard' which allows a user to make a quiz fully how it is needed. Additionally, the application provides user and group management system."
          },
          "loadTestingPlatform": {
            "title": "Load Testing Platform",
            "description": "A platform that provides the ability to load test user's front-end/back-end application. The whole panel displays configurations, test executions, projects and tons of additional and important data such as % test fail ratio or graphs for test parameters."
          }
        }
      },
      "projects": {
        "title": "What have I created?",
        "subtitle": "Private projects",
        "projects": {
          "onlineVisitCard": {
            "title": "Online Visit Card",
            "description": "The project that you are on. My website that is used as my online visit card. You cand find every needed information about me here. I am supporting and updating this project 'daily'."
          },
          "insectifyApi": {
            "title": "Insectify API",
            "description": "Server application that abilities to use web shop."
          },
          "reactAwesomeBoilerplate": {
            "title": "React Awesome Boilerplate",
            "description": "Carefully designed react boilerplate repositorium that gives you fast and smooth start!",
            "warning": "This project is outdated, it will be archived soon. If you are looking for a good React template, look into the Online Visit Card project - an application that you are using right now."
          },
          "mx": {
            "title": "Mx",
            "description": "Matrices computing library"
          }
        }
      },
      "bio": {
        "title": "Who am I?",
        "tiles": [
          {
            "title": "Unbrainless human",
            "subtitle": "How I treat life? Let me introduce myself in few words...",
            "paragraphs": [
              "I am enthusiastic about basing our life decisions on intelligence, experience, and logic. I always consider everything to go through the optimized way.",
              "I treat everything - even the hardest issues and life problems - always as solvable."
            ]
          }, {
            "title": "Freak as well",
            "subtitle": "How did it start?",
            "paragraphs": [
              "About 2 years ago I started my journey by creating simple websites. After a few months, I dived into programming and now I am big fun of it. It looks like I started being freak as well.",
              "It happens sometimes I make a night spending it on coding and delivering my ideas into reality."
            ]
          }, {
            "title": "Evolution",
            "subtitle": "What about future, ideas and plans?",
            "paragraphs": [
              "For today when I look to the past, I learned so many things, but still, there are thousands of technologies and the language that I want to try and learn",
              "In case of that, I do not stop engaging everything that interests me. I expand my knowledge and grow my skills to be a better and more accurate developer."
            ]
          }
        ]
      },
      "skills": {
        "title": "Do I engage awesome technologies?",
        "levels": [
          {
            "title": "Core"
          }, {
            "title": "Side things"
          }, {
            "title": "Short episodes"
          }
        ]
      },
      "workflow": {
        "title": "How my workflow looks like?",
        "tiles": {
          "project": {
            "title": "Project side",
            "description": "In case of project workflow I worked mostly in Agile & Scrum and in customized mixes of those two methodologies. I am fun of organized but flexible workflows that gives a possibility to adapt easily to the situation."
          },
          "git": {
            "title": "Git part",
            "description": "I always tend to use a workflow that is closest to {methodology} methodology. When I got, a task I create one branch, in which I always try to create only one commit and I squash at the end of work - to be sure my main branch will not be cluttered."
          }
        }
      },
      "hobbies": {
        "title": "What my real passions are?",
        "tiles": {
          "programming": {
            "title": "Programming",
            "description": "That is probably not unexpected but I love programming. I am totally into it since 2 years, and I am not going to stop!"
          },
          "insects": {
            "title": "Insects",
            "description": "Yeah, big surprise here. I think insects are one of the rarest hobbies but it is really addicting and awesome. I started with 1 millipede that I bought for my sister 1 year ago. Actually me and my siblings have few spiders, cockroaches, snake and assasing bugs."
          },
          "birdeaters": {
            "title": "Birdeaters",
            "description": "One surprise more. I have and I love birdeaters the same as insects (or actually more than).  My two favorite birdeaters that I actually own are: Marysia - which is Brazilian Salmon Pink Bird Eater and she is going to grow up to 25cm (with legs), and Skarpeta (sock) which is Burgundy Goliath Birdeater that is going to be 30cm big (with legs)."
          }
        }
      }
    }
  }
}