{
  "components": {
    "languageSelect": {
      "languages": {
        "en": "Angielski",
        "pl": "Polski"
      }
    },
    "preventInternetExplorer": {
      "title": "Oops!",
      "subtitle": "Internet explorer wykryty!",
      "description": "Internet explorer w żadnej wersji nie jest wspierany. Nie ponieważ jestem leniwym programistą (bo nie jestem) - nie jest wspierany ze względów bezpieczeństwa. Internet Explorer jest nieaktualny, opary o stare i niebezpieczne technologie i jest nierekomendowane by go używać.",
      "button": "Zaryzykuj i kontynuuj",
      "legend": [
        "* Widzisz to ostrzeżenie, ponieważ cała aplikacja lub komponent nie powinien być używany z Internet Explorerem.",
        "** Kontynuowanie może być niebezpieczne, dodatkowo komponent lub aplikacja mogą zachować się nieprzewidzianie."
      ]
    }
  },
  "layout": {
    "greeting": {
      "subtitle": "Entuzjasta front-endu",
      "subsubtitle": "Aspriujący back-end developer"
    },
    "navigation": {
      "items": {
        "projects": "Projekty",
        "bio": "O mnie",
        "skills": "Umiejętności & technologie",
        "workflow": "Jak pracuje?",
        "passions": "Moje pasje"
      }
    },
    "information": {
      "title": "Strona w trakcie prac."
    },
    "footer": {
      "copyright": "© Wszystkie prawa zastrzeżone {date}"
    }
  },
  "pages": {
    "home": {
      "projects": {
        "title": "Co takiego stworzyłem?",
        "projects": {
          "insectifyApi": {
            "title": "Insectify API",
            "description": "Aplikacja serwerowa udostępniająca możliwości sklepu internetowego."
          },
          "reactAwesomeBoilerplate": {
            "title": "React Awesome Boilerplate",
            "description": "Starannie zaprojektowany starter projektu opartego o Reacta, dający łatwy i szybki start!"
          },
          "mx": {
            "title": "Mx",
            "description": "Biblioteka wspomagająca obliczenia na macierzach"
          }
        }
      },
      "bio": {
        "title": "Kim jestem?",
        "tiles": [
          {
            "title": "Człowiek umysłu",
            "subtitle": "Jak traktuje życie? Niech się opiszę w paru słowach...",
            "paragraphs": [
              "Jestem entuzjastyczny w temacie bazowania naszych życiowych decyzji na inteligencji, doświadczeniu i logice. Zawsze rozważam wszystko, aby podążyć najbardizej optymalną drogą.",
              "Wszystko - nawet najtrudniejsze problemy - traktuje jak rozwiazywalne."
            ]
          }, {
            "title": "Zapewne totalny feak",
            "subtitle": "Jak to się zaczęło?",
            "paragraphs": [
              "Jakieś 2 lata temu zacząłem moją przygodę od tworzenia prostych stron internetowych. Po kilku miesiącach zagłębiłem się w programowaniu i teraz jestem jego ogromnym fanem. Wygląda na to, że zostałem freakiem.",
              "Czasem zdarza się, że zarywam noc spędzając ją na programowaniu i wdrażaniu moich następnych pomysłów w życie."
            ]
          }, {
            "title": "Ewolucja",
            "subtitle": "Co z przyszłośćią, pomysłami, planami?",
            "paragraphs": [
              "Dzisiaj, kiedy patrzę w przeszłóść widzę, jak dużo rzeczy się nauczyłem, ale nadal jest tysiące technologi i języków, których chciałbym spróbować i się nauczyć.",
              "W związku z tym, nie przestaje angażować się we wszystko co mnie interesuje. Poszerzam swoją wiedzę i zwiększam swoje umiejętnośc bybyć lepszym i skuteczniejszym developerem."
            ]
          }
        ]
      },
      "skills": {
        "title": "Czy korzystam z świetnych technologi?",
        "levels": [
          {
            "title": "Filar"
          }, {
            "title": "Poboczne rzeczy"
          }, {
            "title": "Bonusy"
          }
        ]
      },
      "workflow": {
        "title": "Jak wygląda mój workflow?",
        "tiles": {
          "project": {
            "title": "Praca w projekcie",
            "description": "W kwestii workflow w projekcie, pracowałem głównie metodologią Agile i Scrum, dodatkowo ich dostosowanymi do potrzeb mixami. Jestem fanem zoorganizowanego, ale elastycznego trybu pracy, który daje możliwość łatwego zaadaptowania się do sytuacja. "
          },
          "git": {
            "title": "Praca z git'em",
            "description": "Zawsze staram się pracować tak by być najbliżej metodologii {methodology}. Kiedy mam taska, tworzę brancha, w którym zawsze staram się finalnie mieć jednego commita i/lub squash'ować na koniec pracy z taskiem - by być pewnym, że mój branch nie będzie zaśmiecony."
          }
        }
      },
      "hobbies": {
        "title": "Jakie realnie mam pasje?",
        "tiles": {
          "programming": {
            "title": "Programowanie",
            "description": "To prawdopodobnie nie jest niespodziewane, lecz kocham programowanie. Totalnie się w nie wkręciłem 2 lata temu i nie zamierzam przestawać tego robić!"
          },
          "insects": {
            "title": "Owady",
            "description": "O tak, tutaj duże zaskoczenie. Myślę, że owady to jest z najrzadszych hobby, ale jest bardzo uzależniające i świetne to uprawiania. W moim przypadku wszystko zaczęło się od jednego krocionoga, którego kupiłem siostrze w prezencie rok temu. Aktualnie ja i rodzeństwo posiadamy kilka pająków, karaczany, węża i pluskwiaki."
          }
        }
      }
    }
  }
}